rotten_mangoes/app/views/movies/_movies.html.erb

SELECT COUNT(*) FROM "reviews"  WHERE "reviews"."movie_id" = ?  [["movie_id", 1]]
---
        <h5>Genre: <%= movie.category %></h5>
        <% if movie.reviews.size > 0 %>