rotten_mangoes/app/views/movies/index.html.erb

SELECT COUNT(*) FROM "reviews"  WHERE "reviews"."movie_id" = ?  [["movie_id", 1]]
---
  <h3>Genre: <%= movie.category %></h3>
  <% if movie.reviews.size > 0 %>