rotten_mangoes/app/views/movies/show.html.erb

SELECT "reviews".* FROM "reviews"  WHERE "reviews"."movie_id" = ?  [["movie_id", 1]]
SELECT COUNT(*) FROM "reviews"  WHERE "reviews"."movie_id" = ?  [["movie_id", 1]]
---
  <h2><%= @movie.title %> [ <%= link_to "edit", edit_movie_path(@movie) %> | <%= link_to "delete", movie_path(@movie), method: :delete, data: { 'confirm' => "Are you sure you want to delete #{@movie.title}?" } %> ]</h2>
  <% if @movie.reviews.size > 0 %>