rotten_mangoes/app/views/layouts/_footer.html.erb

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
      Signed in as <%= current_user.full_name %> (<%= link_to "Log out", session_path("current"), method: :delete %>)
      	<% if User.find(session[:user_id]).admin %>