rotten_mangoes/app/controllers/admin/users_controller.rb

SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users"
---
	def index
		@users = User.page(params[:page]).per(5)

INSERT INTO "users" ("admin", "created_at", "email", "firstname", "lastname", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
  	@user = User.new(user_params)

  	if @user.save && !current_user

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 12]]
---
  def destroy
  	@user = User.find(params[:id])
  	if @user.id == current_user.id
  		redirect_to admin_users_path, notice: "You cannot delete yourself."
  	else
      # => send an email notification to user
      UserMailer.notify_delete_email(@user).deliver
			@user.destroy

SELECT  "users".* FROM "users"  WHERE (("users"."admin" = 'f' OR "users"."admin" IS NULL)) AND "users"."id" = ? LIMIT 1  [["id", 2]]
---
  def switch
    if !ghost?
      @user = User.where(admin: [false, nil]).find(params[:id])