rotten_mangoes/app/controllers/movies_controller.rb

  def index
    # => http://www.justinweiss.com/blog/2014/02/17/search-and-filter-rails-models-without-bloating-your-controller/
    @search = Movie.all
    @search = @search.by_title(params[:title]) if params[:title].present?
    @search = @search.by_director(params[:director]) if params[:director].present?
    @search = @search.by_category(params[:category]) if params[:category].present?

    if params[:runtime_select].present?
      case params[:runtime_select]
      when 1 # => 'Less than 90 mins'
        @search = @search.duration_less_than_90
      when 2 # => 'Between 90 and 120 mins'
        @search = @search.duration_between_90_and_120
      when 3 # => 'Greater than 120 mins'
        @search = @search.duration_greater_than_120
      end
    end

    @movies = @search.order(title: :asc).page(params[:page]).per(5)
---
SELECT "movies".* FROM "movies"  WHERE (title like '%Zoolander%')  ORDER BY created_at DESC
SELECT "movies".* FROM "movies"  WHERE ("movies"."title" LIKE '%bat%')
SELECT "movies".* FROM "movies"  WHERE (("movies"."title" LIKE '%Batman%' OR "movies"."director" LIKE '%Chris%'))
SELECT "movies".* FROM "movies"  WHERE ((("movies"."title" LIKE '%Batman%' OR "movies"."director" LIKE '%Chris%') OR "movies"."category" LIKE '%Comedy%'))
SELECT  "movies".* FROM "movies"  WHERE (runtime_in_minutes >= 90 AND runtime_in_minutes <= 120)  ORDER BY "movies"."title" ASC LIMIT 5 OFFSET 0
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "movies"  WHERE (title LIKE '%batman%') LIMIT 5 OFFSET 0) subquery_for_count

  def create
  	@movie = Movie.new(movie_params)

  	if @movie.save
---
INSERT INTO "movies" ("category", "created_at", "description", "director", "image", "release_date", "runtime_in_minutes", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @movie = Movie.find(params[:id])

  	if @movie.update_attributes(movie_params)
---
SELECT  "movies".* FROM "movies"  WHERE "movies"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "movies" SET "release_date" = ?, "updated_at" = ? WHERE "movies"."id" = 2  [["release_date", "2015-03-01 00:00:00.000000"], ["updated_at", "2014-10-01 01:44:27.270641"]]